export default class Data {
    static gameW = 720;
    static gameH = 1280;
    
    // Данные игры
    static aColors = []; // массив с цветами
    static aType = [0, 0, 0]; // массив с номерами фигурок 
    static numMove = -1; // номер перетаскиваемой фигурки 
    setNumMove(num){
        numMove = num;
    }   

    getNumMove(){
        return numMove;
    }
     
    // Параметры сетки
    static gridSize = 12;              // 12x12 ячеек
    static cellSize = 54;              // Размер одной ячейки (пиксели)
    static blockSize = 50;              // Размер одной ячейки (пиксели)
    static placeSize = 200;
    static fieldSize = 670;
    
    static radiusBlock = 8;             // Скругление углов ячеек    
    static radiusField = 8;             // Скругление углов поля    
    static radiusPlace = 20;             // Скругление углов мест для размещения фигурок

    // Координаты отрисовки поля (Field)
    static fieldX = 360; // = 670/2+ 25;  // Отступ слева (центрируем: (720 - 670) / 2)
    static fieldY = 526 + 35; //526; // = 670/2+ 190; // Отступ сверху (под блоком счета)

    //static cellX = 73; // = 48+50/2х первой ячейки
    //static cellY = 239; // координата первой ячейки

    static cellX = (720 - this.cellSize*this.gridSize)/2 + this.cellSize/2; // = 48+50/2х первой ячейки
    static cellY = (this.fieldY - this.cellSize*this.gridSize/2 + this.cellSize/2); // координата первой ячейки

    // Параметры фигур (Spawner) 1280 на 720 
    static placeY = 1070;//1050;              // Высота, на которой появляются 3 фигуры
    static placeX = [130, 360, 590]; // X-координаты для левой, средней и правой фигур
    
    // Масштабирование
    static scaleStart = 0.7;  // Насколько уменьшена фигура, пока она внизу
    static scaleReal = 1.0;      // Масштаб фигуры, когда игрок её тащит

    //Colors
    static colorField = 0x4da6ff;
    static colorBlock = 0xff4d4d;
    static colorPlace = 0x000000;
    static color1 = 0xccbcb2; //цвет зетемнения
    static color2 = 0xEFE9E6; //цвет диалогового окна
    static color3 = 0xa66e6f; //цвет текста
    static color4 = 0xA66E6F; //цвет кнопки в диалоговом окне

    static figures = [ //count на единицу меньше
    { count: 1, cells: [[0, 0]], xL: 0, xR: 0, yD: 0 },//0  
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [3, 0], [4, 0]], xL: 0, xR: 4, yD: 0 },//54
    { count: 2, cells: [[0, 0], [0, 1]], xL: 0, xR: 0, yD: 1 },//1
    { count: 5, cells: [[0, 0], [0, 1], [0, 2], [0, 3], [0, 4]], xL: 0, xR: 0, yD: 4 },//53
    { count: 2, cells: [[0, 0], [1, 0]], xL: 0, xR: 1, yD: 0 },//2
    { count: 3, cells: [[0, 0], [0, 1], [0, 2]], xL: 0, xR: 0, yD: 2 },//3
    { count: 3, cells: [[0, 0], [1, 0], [2, 0]], xL: 0, xR: 2, yD: 0 },//4
    { count: 3, cells: [[0, 0], [0, 1], [-1, 1]], xL: 1, xR: 0, yD: 1 },//5
    { count: 3, cells: [[0, 0], [0, 1], [1, 1]], xL: 0, xR: 1, yD: 1 },//6
    { count: 3, cells: [[0, 0], [1, 0], [1, 1]], xL: 0, xR: 1, yD: 1 },//7
    { count: 3, cells: [[0, 0], [1, 0], [0, 1]], xL: 0, xR: 1, yD: 1 },//8
    { count: 4, cells: [[0, 0], [1, 0], [0, 1], [1, 1]], xL: 0, xR: 1, yD: 1 },  //9  
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [0, 3]], xL: 0, xR: 0, yD: 3 },//10
    { count: 1, cells: [[0, 0]], xL: 0, xR: 0, yD: 0 },//0
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [3, 0]], xL: 0, xR: 3, yD: 0 }, //11  

    { count: 4, cells: [[0, 0], [1, 0], [1, 1], [1, 2]], xL: 0, xR: 1, yD: 2 },//14 
    { count: 4, cells: [[0, 0], [1, 0], [0, 1], [0, 2]], xL: 0, xR: 1, yD: 2 },//15 
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [-1, 2]], xL: 1, xR: 0, yD: 2 },//16 
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [1, 2]], xL: 0, xR: 1, yD: 2 },//17 
    { count: 4, cells: [[0, 0], [0, 1], [-1, 1], [-1, 2]], xL: 1, xR: 0, yD: 2 },//18
    { count: 4, cells: [[0, 0], [0, 1], [1, 1], [1, 2]], xL: 0, xR: 1, yD: 2 },//19
    { count: 4, cells: [[0, 0], [0, 1], [-1, 1], [1, 1]], xL: 1, xR: 1, yD: 1 },//20 
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [1, 1]], xL: 0, xR: 2, yD: 1 }, //21
    { count: 4, cells: [[0, 0], [0, 1], [-1, 1], [-2, 1]], xL: 2, xR: 0, yD: 1 },//22 
    { count: 4, cells: [[0, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //23
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [2, 1]], xL: 0, xR: 2, yD: 1 }, //24
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [0, 1]], xL: 0, xR: 2, yD: 1 }, //25
    { count: 4, cells: [[0, 0], [1, 0], [0, 1], [-1, 1]], xL: 1, xR: 1, yD: 1 }, //26
    { count: 4, cells: [[0, 0], [1, 0], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //27
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [1, 1]], xL: 0, xR: 1, yD: 2 },//12
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [-1, 1]], xL: 1, xR: 0, yD: 2 },//13 

    { count: 5, cells: [[0, 0], [1, 1], [-1, 1], [0, 1], [0, 2]], xL: 1, xR: 1, yD: 2 },//28 
    { count: 5, cells: [[0, 0], [2, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //29
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //30
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [-1, 1]], xL: 1, xR: 1, yD: 1 }, //31
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //32
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1]], xL: 0, xR: 2, yD: 1 }, //33
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //34
    { count: 5, cells: [[0, 0], [-2, 1], [-1, 1], [0, 1], [-2, 2]], xL: 2, xR: 0, yD: 2 }, //35
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [-1, 2], [0, 2]], xL: 1, xR: 1, yD: 2 }, //36
    { count: 5, cells: [[0, 0], [1, 0], [1, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 }, //37
    { count: 5, cells: [[0, 0], [0, 1], [1, 1], [2, 1], [2, 2]], xL: 0, xR: 2, yD: 2 }, ///38
    { count: 5, cells: [[0, 0], [0, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//39
    { count: 5, cells: [[0, 0], [0, 1], [-2, 2], [-1, 2], [0, 2]], xL: 2, xR: 0, yD: 2 },//40
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [0, 2]], xL: 0, xR: 2, yD: 2 },//41
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [2, 1], [2, 2]], xL: 0, xR: 2, yD: 2 },//42
    { count: 5, cells: [[0, 0], [-2, 1], [-1, 1], [0, 1], [0, 2]], xL: 2, xR: 0, yD: 2 },//43
    { count: 5, cells: [[0, 0], [0, 1], [1, 1], [2, 1], [0, 2]], xL: 0, xR: 2, yD: 2 },//44
    { count: 5, cells: [[0, 0], [0, 1], [-1, 2], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//45
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//46
    { count: 5, cells: [[0, 0], [1, 0], [1, 1], [0, 2], [1, 2]], xL: 0, xR: 1, yD: 2 },//47
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [0, 2], [1, 2]], xL: 0, xR: 1, yD: 2 },//48
    { count: 5, cells: [[0, 0], [-1, 1], [0, 1], [-1, 2], [0, 2]], xL: 1, xR: 0, yD: 2 },//49
    { count: 5, cells: [[0, 0], [0, 1], [1, 1], [0, 2], [1, 2]], xL: 0, xR: 1, yD: 2 },//50
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [1, 2]], xL: 0, xR: 1, yD: 2 },//51
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [0, 2]], xL: 0, xR: 1, yD: 2 },//52

    { count: 6, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//55
    { count: 6, cells: [[0, 0], [-1, 1], [0, 1], [1, 1], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//56
    { count: 6, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [0, 2], [1, 2]], xL: 0, xR: 1, yD: 2 },//57
    { count: 6, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 },//58
    { count: 6, cells: [[0, 0], [-1, 1], [0, 1], [-2, 2], [-1, 2], [0, 2]], xL: 2, xR: 0, yD: 2 },//59
    { count: 6, cells: [[0, 0], [0, 1], [1, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//60
    { count: 6, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [0, 2]], xL: 0, xR: 2, yD: 2 },//61
    { count: 6, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [2, 1], [2, 2]], xL: 0, xR: 2, yD: 2 },//62
    { count: 6, cells: [[0, 0], [2, 0], [0, 1], [1, 1], [2, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//63
    { count: 6, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//64
    { count: 6, cells: [[0, 0], [-1, 1], [0, 1], [1, 1], [-1, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//65
    { count: 6, cells: [[0, 0], [1, 0], [1, 1], [2, 1], [0, 2], [1, 2]], xL: 0, xR: 2, yD: 2 },//66
    { count: 6, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [-1, 2], [0, 2]], xL: 1, xR: 1, yD: 2 },//67
    { count: 6, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//68
    { count: 6, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1], [2, 2]], xL: 0, xR: 2, yD: 2 },//69
    { count: 6, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [-1, 1], [-1, 2]], xL: 1, xR: 1, yD: 2 },//70
    { count: 6, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [-1, 2], [0, 2]], xL: 1, xR: 1, yD: 2 },//71
    { count: 6, cells: [[0, 0], [1, 0], [1, 1], [2, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//72
    { count: 6, cells: [[0, 0], [0, 1], [1, 1], [2, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//73
    { count: 6, cells: [[0, 0], [-2, 1], [-1, 1], [0, 1], [-2, 2], [-1, 2]], xL: 2, xR: 0, yD: 2 },//74
    { count: 6, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [-2, 2], [-1, 2]], xL: 2, xR: 1, yD: 2 },//75
    { count: 6, cells: [[0, 0], [1, 0], [1, 1], [2, 1], [2, 2], [3, 2]], xL: 0, xR: 3, yD: 2 },//76
    { count: 6, cells: [[0, 0], [0, 1], [1, 1], [1, 2], [2, 2], [2, 3]], xL: 0, xR: 2, yD: 3 },//77
    { count: 6, cells: [[0, 0], [-1, 1], [0, 1], [-2, 2], [-1, 2], [-2, 3]], xL: 2, xR: 0, yD: 3 },//78
    { count: 7, cells: [[0, 0], [2, 0], [0, 1], [1, 1], [2, 1], [0, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//79
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//80
    { count: 8, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [1, 1], [-1, 2], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//81
    { count: 8, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//82
    { count: 8, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//83
    { count: 8, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2]], xL: 0, xR: 2, yD: 2 },//84
    { count: 9, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//85
    { count: 5, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [0, 2]], xL: 1, xR: 1, yD: 2 },//86
    { count: 5, cells: [[0, 0], [1, 0], [1, 1], [2, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//87
    { count: 5, cells: [[0, 0], [-1, 1], [0, 1], [1, 1], [1, 2]], xL: 1, xR: 1, yD: 2 },//88
    { count: 5, cells: [[0, 0], [-1, 1], [0, 1], [1, 1], [-1, 2]], xL: 1, xR: 1, yD: 2 },//89
    { count: 5, cells: [[0, 0], [0, 1], [1, 1], [-1, 2], [0, 2]], xL: 1, xR: 1, yD: 2 },//90
    { count: 5, cells: [[0, 0], [-1, 1], [0, 1], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//91
    { count: 5, cells: [[0, 0], [0, 1], [1, 1], [2, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//92
    { count: 5, cells: [[0, 0], [-2, 1], [-1, 1], [0, 1], [-1, 2]], xL: 2, xR: 0, yD: 2 },//93
    { count: 6, cells: [[0, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2]], xL: 0, xR: 2, yD: 2 },//94
    { count: 6, cells: [[0, 0], [0, 1], [1, 1], [-1, 2], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//95
    { count: 6, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//96
    { count: 6, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [1, 1], [1, 2]], xL: 1, xR: 1, yD: 2 },//97
    { count: 7, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//98
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1], [2, 2]], xL: 0, xR: 2, yD: 2 },//99
    { count: 7, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [-1, 2], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//100
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [0, 2], [1, 2]], xL: 0, xR: 2, yD: 2 },//101
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [2, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//102
    { count: 7, cells: [[0, 0], [-2, 1], [-1, 1], [0, 1], [-2, 2], [-1, 2], [0, 2]], xL: 2, xR: 0, yD: 2 },//103
    { count: 7, cells: [[0, 0], [-1, 1], [0, 1], [1, 1], [-1, 2], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//104
    { count: 7, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2]], xL: 0, xR: 2, yD: 2 },//105
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1], [1, 2]], xL: 0, xR: 2, yD: 2 },//106
    { count: 7, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [1, 1], [0, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//107
    { count: 7, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [1, 1], [-1, 2], [1, 2]], xL: 1, xR: 1, yD: 2 },//108
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//109
    { count: 7, cells: [[0, 0], [2, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2]], xL: 0, xR: 2, yD: 2 },//110
    { count: 7, cells: [[0, 0], [1, 0], [1, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//111
    { count: 7, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//112
    { count: 7, cells: [[0, 0], [1, 0], [-1, 1], [0, 1], [1, 1], [-1, 2], [0, 2]], xL: 1, xR: 1, yD: 2 },//113
    { count: 7, cells: [[0, 0], [2, 0], [0, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//114
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//115
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [2, 1], [0, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//116
    { count: 7, cells: [[0, 0], [1, 0], [2, 0], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//117
    { count: 8, cells: [[0, 0], [2, 0], [0, 1], [1, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//118
    { count: 8, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//119
    { count: 8, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//120
    { count: 8, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1], [2, 1], [0, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//121
    { count: 8, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [2, 1], [0, 2], [1, 2], [2, 2]], xL: 0, xR: 2, yD: 2 },//122
    
    { count: 1, cells: [[0, 0]], xL: 0, xR: 0, yD: 0 },//0 
    { count: 2, cells: [[0, 0], [0, 1]], xL: 0, xR: 0, yD: 1 },//1
    { count: 2, cells: [[0, 0], [1, 0]], xL: 0, xR: 1, yD: 0 },//2
    { count: 3, cells: [[0, 0], [0, 1], [0, 2]], xL: 0, xR: 0, yD: 2 },//3
    { count: 3, cells: [[0, 0], [1, 0], [2, 0]], xL: 0, xR: 2, yD: 0 },//4
    { count: 3, cells: [[0, 0], [0, 1], [-1, 1]], xL: 1, xR: 0, yD: 1 },//5
    { count: 3, cells: [[0, 0], [0, 1], [1, 1]], xL: 0, xR: 1, yD: 1 },//6
    { count: 3, cells: [[0, 0], [1, 0], [1, 1]], xL: 0, xR: 1, yD: 1 },//7
    { count: 3, cells: [[0, 0], [1, 0], [0, 1]], xL: 0, xR: 1, yD: 1 },//8
    { count: 4, cells: [[0, 0], [1, 0], [0, 1], [1, 1]], xL: 0, xR: 1, yD: 1 },  //9  
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [0, 3]], xL: 0, xR: 0, yD: 3 },//10
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [3, 0]], xL: 0, xR: 3, yD: 0 }, //11  
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [1, 1]], xL: 0, xR: 1, yD: 2 },//12
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [-1, 1]], xL: 1, xR: 0, yD: 2 },//13
    { count: 4, cells: [[0, 0], [1, 0], [1, 1], [1, 2]], xL: 0, xR: 1, yD: 2 },//14 
    { count: 4, cells: [[0, 0], [1, 0], [0, 1], [0, 2]], xL: 0, xR: 1, yD: 2 },//15 
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [-1, 2]], xL: 1, xR: 0, yD: 2 },//16 
    { count: 4, cells: [[0, 0], [0, 1], [0, 2], [1, 2]], xL: 0, xR: 1, yD: 2 },//17 
    { count: 4, cells: [[0, 0], [0, 1], [-1, 1], [-1, 2]], xL: 1, xR: 0, yD: 2 },//18
    { count: 4, cells: [[0, 0], [0, 1], [1, 1], [1, 2]], xL: 0, xR: 1, yD: 2 },//19
    { count: 4, cells: [[0, 0], [0, 1], [-1, 1], [1, 1]], xL: 1, xR: 1, yD: 1 },//20 
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [1, 1]], xL: 0, xR: 2, yD: 1 }, //21
    { count: 4, cells: [[0, 0], [0, 1], [-1, 1], [-2, 1]], xL: 2, xR: 0, yD: 1 },//22 
    { count: 4, cells: [[0, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //23
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [2, 1]], xL: 0, xR: 2, yD: 1 }, //24
    { count: 4, cells: [[0, 0], [1, 0], [2, 0], [0, 1]], xL: 0, xR: 2, yD: 1 }, //25
    { count: 4, cells: [[0, 0], [1, 0], [0, 1], [-1, 1]], xL: 1, xR: 1, yD: 1 }, //26
    { count: 4, cells: [[0, 0], [1, 0], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //27
    { count: 5, cells: [[0, 0], [1, 1], [-1, 1], [0, 1], [0, 2]], xL: 1, xR: 1, yD: 2 },//28 
    { count: 5, cells: [[0, 0], [2, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //29
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //30
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [-1, 1]], xL: 1, xR: 1, yD: 1 }, //31
    { count: 5, cells: [[0, 0], [1, 0], [0, 1], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //32
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [0, 1], [1, 1]], xL: 0, xR: 2, yD: 1 }, //33
    { count: 5, cells: [[0, 0], [1, 0], [2, 0], [1, 1], [2, 1]], xL: 0, xR: 2, yD: 1 }, //34

    ];

    static colors = [
    { count: 0, color: 0xe1d7d3 },
    { count: 1, color: 0x847c9f },
    { count: 2, color: 0xb8b129 },
    { count: 3, color: 0xef7c8f },
    { count: 4, color: 0xbb9197 },
    { count: 5, color: 0x6393bb },
    { count: 6, color: 0xf49686 },
    { count: 7, color: 0x68a1a5 },
    { count: 8, color: 0x94b3c6 },
    { count: 9, color: 0x9aac76 }     
    
    ];

};